Revit 2027 API
Rectangle(Rectangle) Constructor
 Constructs a new copy of the input ScreenRectangle object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Rectangle(
	Rectangle other
)
Public Sub New (
	other As Rectangle
)
public:
Rectangle(
	Rectangle^ other
)
new :
        other : Rectangle -> Rectangle
Parameters
other Rectangle
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Rectangle Class
Rectangle Overload
Autodesk.Revit.DB Namespace